Revit 2027 API
LightGroupManager.SetLightOn Method
 Turns the given light on or off for rendering the given view depending on the bool argument
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLightOn(
	ElementId viewId,
	ElementId lightId,
	bool turnOn
)
Public Sub SetLightOn (
	viewId As ElementId,
	lightId As ElementId,
	turnOn As Boolean
)
public:
void SetLightOn(
	ElementId^ viewId,
	ElementId^ lightId,
	bool turnOn
)
member SetLightOn :
        viewId : ElementId *
        lightId : ElementId *
        turnOn : bool -> unit
Parameters
viewId ElementId
 The Id of the view
lightId ElementId
 The Id of the light to turn on or off
turnOn Boolean
 Turns the light on if true, off if false
Exceptions
Exception | Condition
ArgumentException |  The given element Id does not correspond to a 3d view -or- The given element Id does not correspond to a light instance
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace